lab8/requests/events/futureEvents.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="pl/pwr/java/lab8/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:fetchFutureEventsRequest/>
    </soapenv:Body>
</soapenv:Envelope>